_posts/2016-08-21-sicp-in-texinfo.html
---
layout: page
title: Using a Texinfo edition of SICP
category: note
---

<section id="outline-container-org8196a9a" class="outline-2">
<h2 id="org8196a9a"></h2>
<div class="outline-text-2" id="text-org8196a9a">
<p>
SICP's availability has allowed for reworking it's text for contemporary
audiences. A notable piece of kit that's come light years since the 80s is Emacs
which today regarded as the best environment for doing SICP and programming
Scheme.
</p>

<p>
Emacs offers an extremely in-depth (if esoteric) help system using the document
format Texinfo. Installing texinfo documents is simple but the provided
documentation inexplicably leaves out critical steps. Here's what I did to get
it working
</p>

<ol class="org-ol">
<li><a href="http://www.neilvandyke.org/sicp-texi/sicp.info.gz">Download a <i>.texi</i> copy of SICP</a></li>
<li><span class="verbatim">$ mv =(unzip sicp.info.gz) /usr/local/share/info</span></li>
<li><span class="verbatim">$ install-info ~/Downloads/sicp.info.gz</span></li>
</ol>
</div>
</section>
